Repository: pypi-data/pypi-mirror-306
Catalog: packages/rougail/rougail-1.1.1.tar.gz/rougail-1.1.1/locale/*/LC_MESSAGES/rougail.po
Languages: fr

source: default variable mode "{0}" is not a valid mode, valid modes are {1}
fr: le mode d'une variable par défaut "{0}" n'est pas un mode valide, les modes valides sont {1}

source: default family mode "{0}" is not a valid mode, valid modes are {1}
fr: le mode d'une famille par défaut "{0}" n'est pas un mode valide, les modes valides sont {1}

source: mode "{0}" for "{1}" is not a valid mode, valid modes are {2}
fr: le mode "{0}" pour "{1}" n'est pas un mode valide, les modes valides sont {2}

source: mode "{0}" for "{1}" is not a valid mode, no modes are available
fr: le mode "{0}" pour "{1}" n'est pas un mode valide, aucun mode ne sont définis

source: the variable "{0}" is mandatory so in "{1}" mode but family has the higher family mode "{2}"
fr: la variable "{0}" est obligatoire donc dans le mode "{1}" mais la famille a un mode supérieur "{2}"

source: the follower "{0}" is in "{1}" mode but leader have the higher mode "{2}"
fr: la variable suiveuse "{0}" a le mode "{1}" mais la variable leader a un mode supérieur "{2}"

source: the family "{0}" is in "{1}" mode but variables and families inside have the higher modes "{2}"
fr: la famille "{0}" a le mode "{1}" mais les variables et les familles à l'intérieur ont des modes supérieurs "{2}"

source: the variable "{0}" is in "{1}" mode but family has the higher family mode "{2}"
fr: la variable "{0}" est dans le mode "{1}" mais la famille a le mode supérieur "{2}"

source: the follower "{0}" without multi attribute can only have one value
fr: la variable suiveuse "{0}" sans l'attribut multi peut avoir seulement une valeur

source: the variable "{0}" is multi but has a non list default value
fr: la variable "{0}" est multiple mais a une valeur par défaut sans être une liste

source: the variable "{0}" has regexp attribut but has not the "regexp" type
fr: la variable "{0}" a un attribut regexp mais n'a pas le type "regexp"

source: the variable "{0}" has choices attribut but has not the "choice" type
fr: la variable "{0}" a un attribut choices mais n'a pas le type "choice"

source: the variable "{0}" has an unvalid default value "{1}" should be in {2}
fr: la variable "{0}" a la valeur par défaut invalide "{1}" devrait être {2}

source: A variable or a family located in the "{0}" namespace shall not be used in the "{1}" namespace
fr: Une variable ou une famille localisé dans l'espace de nom "{0}" ne devrait pas être utilisé dans l'espace de nom "{1}"

source: unknown type {0} for {1}
fr: type {0} inconnu pour {1}

source: duplicate dictionary file name {0}
fr: nom de fichier {0} de dictionnaire dupliqué

source: Cannot execute annotate multiple time
fr: Ne peut exécuter l'annotation plusieurs fois

source: {0} in {1}
fr: {0} dans {1}

source: alternative_name "{0}" conflict with "--help"
fr: alternative_name "{0}" est en conflit avec "--help"

source: conflict alternative_name "{0}": "{1}" and "{2}"
fr: conflit dans les "alternative_name" "{0}": "{1}" et "{2}"

source: negative_description is mandatory for boolean variable, but "{0}" hasn't
fr: l'attribut negative_description est obligatoire pour des variables "boolean", mais "{0}" n'en a pas

source: negative_description is only available for boolean variable, but "{0}" is "{1}"
fr: l'attribut negative_description est seulement valide pour des variables "boolean", mais "{0}" est "{1}"

source: not a XML file: {0}
fr: fichier XML invalid : {0}

source: invalid variable or family name "{0}" must only contains lowercase ascii character, number or _
fr: nom invalide pour la variable ou famille "{0}" doit seulement contenir des caractères ascii minuscule, nombre or _

source: error in jinja "{0}" for the variable "{1}": {2}
fr: erreur dans Jinja "{0}" pour la variable "{1}": {2}
