Repository: pypi-data/pypi-mirror-306
Catalog: packages/fossbill/fossbill-1.8.1-py3-none-any.whl/fossbill/locale/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: Username is required.
fr_fr: Nom d'utilisateur requis.

source: Password is required.
fr_fr: Mot de passe requis.

source: Incorrect username.
fr_fr: Nom d'utilisateur incorect.

source: Incorrect password.
fr_fr: Mauvais mot de passe

source: Fossbill - User password reset
fr_fr: Fossbill - Réinitialisation de mot de passe

source: Email is required.
fr_fr: E-mail requis.

source: We failed to send the mail:
fr_fr: Nous avons échoué à envoyer le mail:

source: If the email matched, a password reset token has been generated.
fr_fr: Si le mail est connu, un token de réinitialisation de mot de pass a été généré.

source: Token is required.
fr_fr: Token requis.

source: Invalid token.
fr_fr: Le token n'est pas valide.

source: Token already expired.
fr_fr: Le token est déja expiré.

source: Something went wrong.
fr_fr: Quelque chose a échoué.

source: Password updated.
fr_fr: Mot de passe modifié.

source: We need more of your SMTP configuration.
fr_fr: Nous avons besoin de votre configuration SMTP d'abord.

source: Customer id should be an integer.
fr_fr: Id de client doit être un chiffre entier.

source: Bill created.
fr_fr: Facture crée.

source: Recipient is required.
fr_fr: Destinataire requis.

source: Source is required.
fr_fr: Origine requise.

source: Quote mentions are required.
fr_fr: Les mentions de devis sont requis.

source: Bill mentions are required.
fr_fr: Les mentions de facture sont requis

source: Is paid is required.
fr_fr: Est payé est requis.

source: Is paid can be 0 or 1.
fr_fr: Est payé peut être 0 ou 1.

source: Bill updated.
fr_fr: Facture modifiée.

source: This bill is not a draft.
fr_fr: Cette facture n'est pas un brouillon.

source: Bill deleted.
fr_fr: Facture supprimée.

source: Product id should be an integer.
fr_fr: Id de produit doit être un chiffre entier.

source: Label is required.
fr_fr: Label requis.

source: Price is required.
fr_fr: Prix requis.

source: Tax rate is required.
fr_fr: Taux de tax requis.

source: Price should be a float.
fr_fr: Prix doit être un chiffre.

source: Tax rate should be a float.
fr_fr: Taux de tax doit être un chiffre

source: Tax rate should be higher than 0.
fr_fr: Taux de taxe doit être supérieur à 0.

source: Tax rate should be lower than 100.
fr_fr: Taux de taxe doit être inférieur à 100.

source: Either give a product id or all.
fr_fr: Utilisez soit un id de produit soit tous.

source: Quantity is required.
fr_fr: Quantité requise.

source: Quantity should be an integer.
fr_fr: Quantité doit être un chiffre entier.

source: Bill row created.
fr_fr: Ligne de facture crée.

source: Bill row updated.
fr_fr: Ligne de facture modifiée.

source: Bill row deleted.
fr_fr: Ligne de facture supprimée.

source: Quote finished.
fr_fr: Devis généré.

source: This bill already is finished.
fr_fr: Cette facture est déja générée.

source: Bill finished.
fr_fr: Facture générée.

source: This is a template bill
fr_fr: Ceci est un template de facture

source: EI John Doe SIRET XXXXXXXXXXXXXX XXX Street of Smith XXXXX Bright United state
fr_fr: EI Bernard Noyer SIRET XXXXXXXXXXXXXX XXX Rue Jean Bignon XXXXX Perpignan France

source: Malton Cober SIRET XXXXXXXXXXXXXX XXX Street of Cobolt XXXXX Dark United state
fr_fr: Michel Franc SIRET XXXXXXXXXXXXXX XXX Rue Pignon XXXXX Paris

source: This quote is not generated.
fr_fr: Ce devis n'est pas généré.

source: Subject is required.
fr_fr: Sujet requis.

source: Body is required.
fr_fr: Corp requis.

source: Email sent.
fr_fr: Email envoyé.

source: Quote
fr_fr: Devis

source: This bill is not generated.
fr_fr: Cette facture n'est pas générée.

source: Bill
fr_fr: Facture

source: Customer created.
fr_fr: Customer créé.

source: Customer updated.
fr_fr: Customer modifié.

source: Customer deleted.
fr_fr: Customer supprimé.

source: Test email from Fossbill
fr_fr: Email de test de la part de Fossbill

source: We sent an email to you.
fr_fr: Nous vous avons envoyé un mail.

source: SMTP Port should be an integer.
fr_fr: Port SMTP doit être un chiffre entier.

source: SMTP Security should be one of {available_protocols}.
fr_fr: Sécurité SMTP doit être l'une des {available_protocols}.

source: Locale should be one of {available_locales}.
fr_fr: Langue doit être l'une des {available_locales}.

source: User updated.
fr_fr: Utilisateur modifié.

source: All bills has been deleted.
fr_fr: Toutes les factures ont été supprimées.

source: File is required.
fr_fr: Fichier requis.

source: The file format seems incorrect.
fr_fr: Le format du fichier semble incorrect.

source: User data imported.
fr_fr: Données utilisateur importés.

source: Bill style is required.
fr_fr: Les styles de facture sont requis.

source: Bill style updated.
fr_fr: Styles de facture mis à jours.

source: Subscription active and expire the {}
fr_fr: Abonnement actif et expire le {}

source: Grace period on. Register a payment method.
fr_fr: Periode gratuite active. Enregistrer un moyen de payment.

source: You are admin, but you can still pay for the service.
fr_fr: Vous êtes administrateur, mmais vous pouvez toujours souscrire au service.

source: Free mode on, but you can still pay for the service.
fr_fr: Vous êtes un accès gratuit, mmais vous pouvez toujours souscrire au service.

source: Your subscription is disabled. Please update your payment method.
fr_fr: Votre abonnement est inactif. Veuillez mettre à jour votre moyen de payment.

source: Stripe token is required.
fr_fr: Token requis.

source: Payment went wrong.
fr_fr: Le paiement a échoué.

source: Payment method created.
fr_fr: Moyen de paiement créé.

source: Email notice went wrong.
fr_fr: La notification email a échoué.

source: Payment method created, and card has been charged.
fr_fr: Moyen de paiement crée, et virement effectué.

source: You don't have any payment method registered yet.
fr_fr: Vous n'avez pas encore de moyen de paiement enregistré.

source: Payment method deleted.
fr_fr: Moyen de paiement supprimé.

source: Product created.
fr_fr: Produit crée.

source: Product updated.
fr_fr: Produit modifié.

source: Product deleted.
fr_fr: Produit supprimé.

source: A password reset token has been generated, and sent
fr_fr: Un token de reset de mot de passe a été généré, et envoyé.

source: A password reset token has been generated.
fr_fr: Un token de reset de mot de passe a été généré.

source: User is now non-free
fr_fr: L'utilisateur n'est plus gratuit

source: User is now free
fr_fr: L'utilisateur est maintenant gratuit

source: User is now regular
fr_fr: L'utilisateur est redevenu normal

source: User is now admin
fr_fr: L'utilisateur est maintenant administrateur

source: Payments
fr_fr: Paiements

source: Users
fr_fr: Utilisateurs

source: Products
fr_fr: Produits

source: Customers
fr_fr: Clients

source: Bills
fr_fr: Factures

source: Log Out
fr_fr: Déconnection

source: Register
fr_fr: Enregistrement

source: Log In
fr_fr: Connection

source: First
fr_fr: Prem

source: Prev
fr_fr: Préc

source: Next
fr_fr: Suiv

source: Last
fr_fr: Dern

source: Reset password
fr_fr: Reset de mot de passe

source: Submit
fr_fr: Envoyer

source: Username
fr_fr: Utilisateur

source: Password
fr_fr: Mot de passe

source: Forgotten password
fr_fr: Mot de passe perdu

source: Hey, Here the invoice #%(billnumber)s Respects,
fr_fr: Bonjour, Voici la facture #%(billnumber)s Cordialement,

source: New Bill
fr_fr: Nouvelle facture

source: From scratch
fr_fr: Depuis rien

source: Save
fr_fr: Enregistrer

source: Create row
fr_fr: Créer une ligne

source: From an existing product.
fr_fr: Depuis un produit éxistant.

source: Product
fr_fr: Produit

source: Quantity
fr_fr: Quantité

source: Create another?
fr_fr: Continuer?

source: From scratch.
fr_fr: De rien.

source: Price
fr_fr: Prix

source: Tax rate
fr_fr: Taux de taxe

source: Return
fr_fr: Retour

source: Finish quote
fr_fr: Finir le devis

source: Finish draft
fr_fr: Finaliser le brouillon

source: The quote already has been generated.
fr_fr: Le devis a déja été généré.

source: Create a quote first, then create a bill later.
fr_fr: Créer un devis d'abord, et crée une facture plus tard.

source: Create quote
fr_fr: Créer le devis

source: Are you sure?
fr_fr: Êtes-vous sûr·e?

source: Create the bill.
fr_fr: Créer la facture.

source: Create a bill now, but you can't create a quote later.
fr_fr: Créer une facture maintenant, mais vous ne pourrez créer un devis plus tard.

source: Create bill
fr_fr: Créer la facture

source: Bill #%(billnumber)s
fr_fr: Facture #%(billnumber)s

source: From
fr_fr: De

source: To
fr_fr: À

source: Generated %(date)s
fr_fr: Généré le %(date)s

source: From quote #%(quotenumber)s
fr_fr: Du devis #%(quotenumber)s

source: Quote #%(quotenumber)s
fr_fr: Devis #%(quotenumber)s

source: Draft
fr_fr: Brouillon

source: Issued %(date)s
fr_fr: Généré le %(date)s

source: Detail
fr_fr: Ligne

source: Qty
fr_fr: Qte

source: Amount
fr_fr: Montant

source: Tax
fr_fr: Taxe

source: New
fr_fr: Nouveau

source: Show filters
fr_fr: Afficher les filtres

source: Quote number
fr_fr: Numéro de devis

source: Bill number
fr_fr: Numéro de facture

source: Created after
fr_fr: Crée après

source: Created before
fr_fr: Crée avant

source: Amount greater than
fr_fr: Montant supérieur à

source: Amount lower than
fr_fr: Montant inférieur à

source: Recipient
fr_fr: Déstinataire

source: Is paid?
fr_fr: Est payé?

source: Choose an option
fr_fr: Choisir une option

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Filter
fr_fr: Filtrer

source: Reset
fr_fr: Réinitialiser

source: Created at
fr_fr: Crée le

source: Edit
fr_fr: Modifier

source: Count
fr_fr: Compte

source: Gross amount
fr_fr: Montant HT

source: Tax amount
fr_fr: Montant taxes

source: Hey, Here the quote #%(quotenumber)s Respects,
fr_fr: Bonjour, Voici le devis #%(quotenumber)s Cordialement,

source: Send bill email
fr_fr: Envoyer le mail de la facture

source: Subject
fr_fr: Sujet

source: Body
fr_fr: Corp

source: Send quote email
fr_fr: Envoyer le mail du devis

source: Empty
fr_fr: Vide

source: Taken from customer address.
fr_fr: Prise depuis l'adresse cliente.

source: Source
fr_fr: Origine

source: Taken from your user configuration.
fr_fr: Pris depuis votre configuration utilisateur.

source: Quote mentions
fr_fr: Mentions de devis

source: Bill mentions
fr_fr: Mentions de factures

source: Comment
fr_fr: Commentaire

source: Delete
fr_fr: Supprimer

source: View draft
fr_fr: Voir le brouillon

source: View quote
fr_fr: Voir le devis

source: View bill
fr_fr: Voir la facture

source: Edit row
fr_fr: Modifier la ligne

source: Cancel
fr_fr: Annuler

source: New Customer
fr_fr: Nouveau client

source: Logo URL
fr_fr: URL du logo

source: Used in the top right corner in bills.
fr_fr: Utilisé dans le coin haut droit sur les factures.

source: Address
fr_fr: Adresse

source: Ex: John Doe 221 B Baker street, London, United Kingdom SIREN: 508 102 811
fr_fr: Ex: Bernard Thiery 221 B Rue Baker, Londre, Royaume-Unis SIREN: 508 102 811

source: Edit "%(customerlabel)s"
fr_fr: Modifier "%(customerlabel)s"

source: Dashboard
fr_fr: Tableau de bord

source: Thanks a lot for registering, and welcome aboard! Fossbill is a really simple tool. Here some guidelines:
fr_fr: Merci beaucoup de vous être enregistré, et bienvenue à bord ! Fossbill est un outil simple. Voici quelques pistes pour commencer :

source: You should start by editing your user preference. Then add some products you use frequently. You can also prepare your customer list. Registering products and customers isnt necessary but it make generating bills faster.
fr_fr: Vous devriez commencer par modifier vos informations d'utilisateur. Ensuite enregistrer quelques produits que vous utiliserez souvent. Vous pouvez aussi préparer votre liste de clients. Enregistrer vos produits et vos clients n'est pas obligatoire, mais cela rends la génération de facture plus rapide.

source: Bills will be Drafts untill you generate a Quote or directly a Bill from them. Unique numbers will be applied on them.
fr_fr: Les factures seront des brouillons jusqu'à ce que vous génériez le devis ou directement la facture. Des numéro uniques leur seront appliqué

source: You can preview and also send them to any email address you want, as quote or bill.
fr_fr: Vous pouvez prévisualiser, et également envoyer sur n'importe quelle adresse email que vous voulez, vos factures et devis.

source: Welcome!
fr_fr: Bienvenue !

source: Fossbill is a minimalist tool to edit, generate and send bills to emails. It is FOSS as it is licenced under AGPL3. Its source code can be pulled <a href="https://sr.ht/~stacyharper/fossbill">here</a>.
fr_fr: Fossbill est un outil minimaliste pour éditer, générer et envoyer des factures par emails. Il est open-source et est sous licence AGPL3. Son code source peut être récupéré <a href="https://sr.ht/~stacyharper/fossbill">ici</a>.

source: It is really easy to self-host an instance of Fossbill. Feels free to check the <a href="https://git.sr.ht/~stacyharper/fossbill">documentation</a> to configure it to suits your needs.
fr_fr: Il est très facile d'auto-héberger une instance de Fossbill. Consultez la <a href="https://git.sr.ht/~stacyharper/fossbill">documentation</a> pour la configurer selon vos besoins.

source: Fossbill is free as in freedom, but this hosted instance cost 10 euros/month. This support the development of the tool, and encourage me to build new ones.
fr_fr: Fossbill est libre, mais cette instance hébergé coute 10 euros/mois. Cela supporte le développement de l'outil, et m'encourage à en mettre en place de nouveaux.

source: I am Willow Barraco, a french developper girl and I live near Lyon. I write free and open-source softwares. I am very active in the Alpine Linux / Postmarketos ecosystem as a <a href="https://sxmo.org">sxmo</a> co-maintainer. Here my <a href="https://www.willowbarraco.fr">website</a> and my <a href="https://sr.ht/~stacyharper">projects</a>.
fr_fr: Je suis Willow Barraco, une développeuse Française et je vis proche de Lyon. Je développe des programmes open-sources et libres. Je suis très active dans l'environnement Alpine Linux / Postmarketos en tant que co-maintaineuse. Voici mon <a href="https://www.willowbarraco.fr">site</a> et mes <a href="https://sr.ht/~stacyharper">projets</a>.

source: File
fr_fr: Fichier

source: Import
fr_fr: Importer

source: Export
fr_fr: Exporter

source: Hey there! This is a test message from Fossbill! Do you copy?
fr_fr: Salut ! Ceci est un message de Fossbill ! Est-ce que tu me reçois ?

source: Edit "%(username)s"
fr_fr: Modifier "%(username)s"

source: Locale
fr_fr: Langue

source: English
fr_fr: Anglais

source: French
fr_fr: Français

source: Used for password recovery. Must be unique.
fr_fr: Utilisé pour la récupération de mot de passe. Doit être unique.

source: Currency
fr_fr: Monnaie

source: Used in the top left corner in bills.
fr_fr: Utillisé dans le coin haut gauche sur les factures.

source: Default source
fr_fr: Origine par défaut

source: The top-left part on generated bills. Represent your company.
fr_fr: Partie en haut à gauche sur les factures générés. Représente votre entité.

source: Bottom text on generated quotes.
fr_fr: Texte du bas sur les devis générés.

source: Bottom text on generated bills.
fr_fr: Texte du bas sur les factures générés.

source: SMTP host
fr_fr: Domaine SMTP

source: SMTP port
fr_fr: Port SMTP

source: SMTP security
fr_fr: Sécurité SMTP

source: Select an option
fr_fr: Choisir une option

source: SMTP username
fr_fr: Utilisateur SMTP

source: SMTP password
fr_fr: Mot de passe SMTP

source: SMTP reply-to
fr_fr: Repondre à SMTP

source: Ex: John Doe <contact@john-doe.com> (Can stay empty)
fr_fr: Ex: John Doe <contact@john-doe.com> (Peut rester vide)

source: SMTP cc
fr_fr: Copie carbone SMTP

source: Test Email
fr_fr: Tester le mail

source: Delete user
fr_fr: Supprimer l'utilisateur

source: You are about to delete all data associated to this account.\nAre you sure?
fr_fr: Vous êtes sur le point de supprimer toutes les données associée à ce compte.\nÊtes-vous sur·e?

source: Delete bills
fr_fr: Vider les factures

source: You are about to delete all of your bills.\nAre you sure?
fr_fr: Vous êtes sur le point de supprimer toutes vos factures. Êtes-vous sur·e?

source: Edit bill style
fr_fr: Modifier les styles de facture

source: Bill style
fr_fr: Styles de factures

source: Payment details
fr_fr: Détails du paiement

source: New card
fr_fr: Nouvelle carte

source: Save card
fr_fr: Enregistrer la carte

source: Delete payment method
fr_fr: Supprimer le moyen de paiement.

source: Card
fr_fr: Carte

source: %(cardbrand)s ending with %(last4)s
fr_fr: %(cardbrand)s se terminant par %(last4)s

source: Invoice
fr_fr: Facture

source: Receipt
fr_fr: Reçu

source: Invoice #%(invoiceid)s
fr_fr: Facture #%(invoiceid)s

source: Details
fr_fr: Détail

source: fossbill.org subscription fee
fr_fr: fossbill.org redevance d'abonnement

source: Paid with
fr_fr: Payé avec

source: Paid on
fr_fr: Payé le

source: Valid for service through
fr_fr: Valide pour le service jusqu'au

source: New Product
fr_fr: Nouveau produit

source: Ex: Consulting day
fr_fr: Ex: Journée consulting

source: Price greater than
fr_fr: Prix supérieur à

source: Price lower than
fr_fr: Prix inférieur à

source: Tax rate greater than
fr_fr: Taux de taxe supérieur à

source: Tax rate lower than
fr_fr: Taux de taxe inférieur à

source: Edit "%(productlabel)s"
fr_fr: Modifier "%(productlabel)s"

source: Admin?
fr_fr: Administrateur?

source: Free?
fr_fr: Gratuit?

source: Payment enabled?
fr_fr: Paiement actif?

source: Enabled
fr_fr: Activé

source: Disabled
fr_fr: Désactivé

source: Active payment
fr_fr: Paiement actif

source: Due at
fr_fr: Expire le

source: Free
fr_fr: Gratuit

source: ⟲ free
fr_fr: ⟲ gratuit

source: Contact
fr_fr: Contacter
