Repository: pypi-data/pypi-mirror-306
Catalog: packages/rougail.output_doc/rougail_output_doc-0.1.0.tar.gz/rougail_output_doc-0.1.0/locale/*/LC_MESSAGES/rougail_output_doc.po
Languages: fr

source: the domain name can starts by a dot
fr: le nom de domaine peut commencé par un point

source: the domain name can be a hostname
fr: le nom de domaine peut être un nom d'hôte

source: the domain name can be an IP
fr: le nom de domaine peut être une IP

source: the domain name can be network in CIDR format
fr: le nom de domaine peut être un réseau au format CIDR

source: the minimum value is {0}
fr: le valeur minimal est {0}

source: the maximum value is {0}
fr: le valeur maximal est {0}

source: IP must be in CIDR format
fr: IP doit être au format CIDR

source: private IP are allowed
fr: les IP privées sont autorisés

source: reserved IP are allowed
fr: les IP réservés sont autorisés

source: the host name can be an IP
fr: le nom d'hôte peut être une IP

source: the domain name in web address can be an IP
fr: le nom de domaine dans l'adresse web peut être une IP

source: the domain name in web address can be only a hostname
fr: le nom de domaine dans l'adresse web ne peut être qu'un nom d'hôte

source: can be range of port
fr: peut être un range de port

source: can have the protocol
fr: peut avoir un protocole

source: port 0 is allowed
fr: le port 0 est autorisé

source: ports 1 to 1023 are allowed
fr: les ports entre 1 et 1023 sont autorisés

source: ports 1024 to 49151 are allowed
fr: les ports entre 1024 et 49151 sont autorisés

source: ports greater than 49152 are allowed
fr: les ports supérieurs à 49152 sont autorisés

source: mandatory
fr: obligatoire

source: hidden
fr: caché

source: disabled
fr: désactivé

source: auto modified
fr: auto modifiée

source: Variables for "{0}"
fr: Variables pour "{0}"

source: Example with mandatory variables not filled in
fr: Exemple avec des variables obligatoire non renseignée

source: (default)
fr: (defaut)

source: Choices
fr: Choix

source: Default
fr: Défaut

source: the value of the variable "{0}"
fr: la valeur de la variable "{0}"

source: value of the {0}
fr: la valeur de {0}

source: Example
fr: Exemple

source: Examples
fr: Exemples
