Repository: pypi-data/pypi-mirror-306
Catalog: packages/mds-cashbook-planner/mds_cashbook_planner-7.0.8-py3-none-any.whl/trytond/modules/cashbook_planner/locale/*.po
Languages: de

# model:ir.message,text:msg_title_notify
source: Cashbook Scheduled Booking
de: Kassenbuch geplante Buchung

# model:ir.message,text:msg_text_notify
source: The following transaction was generated: %(bname)s
de: Die folgende Buchung wurde erzeugt: %(bname)s

# selection:ir.cron,method:
source: Execute scheduled bookings
de: geplante Buchungen ausführen

# model:res.group,name:group_planner
source: Cashbook - Scheduled Bookings
de: Kassenbuch - geplante Buchungen

# model:ir.ui.menu,name:menu_planner
source: Scheduled Bookings
de: geplante Buchungen

# model:ir.action,name:act_planner_view
source: Scheduled Bookings
de: geplante Buchungen

# model:ir.model.button,string:book_now_button2
source: Execute Booking Now
de: Buchung jetzt ausführen

# model:ir.model.button,help:book_now_button2
source: The planned booking is brought forward and executed now. The next posting is then scheduled regularly for the following execution.
de: Die geplante Buchung wird vorgezogen und jetzt ausgeführt. Die nächste Buchung wird dann regulär für die nachfolgende Ausführung geplant.

# model:ir.model.button,confirm:book_now_button2
source: The booking is now being made. Continue?
de: Die Buchung wird nun durchgeführt. Fortsetzen?

# model:ir.rule.group,name:rg_planner_admin
source: Administrators: scheduled bookings read/write
de: Administratoren: geplante Buchungen schreiben

# model:ir.rule.group,name:rg_planner_owner
source: Owners: scheduled bookings
de: Eigentümer: geplante Buchungen

# model:ir.rule.group,name:rg_planner_read_nonowner
source: Observers: scheduled bookings read
de: Beobachter: geplante Buchungen lesen

# model:ir.rule.group,name:rg_planner_write_nonowner
source: Reviewer: scheduled bookings write
de: Bearbeiter: geplante Buchungen schreiben

# model:ir.rule.group,name:rg_planner_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_nextrun_admin
source: Administrators: scheduled bookings read/write
de: Administratoren: geplante Buchungen schreiben

# model:ir.rule.group,name:rg_nextrun_companies
source: User in companies
de: Benutzer im Unternehmen

# view:cashbook.configuration:
source: Scheduled Bookings
de: geplante Buchungen

# field:cashbook.configuration,holidays:
source: Holidays
de: Feiertage

# help:cashbook.configuration,holidays:
source: Semicolon separate list of dates: yyyy-mm-dd = single date, mm-dd = annual repetition, easter[greg|jul|orth] = Easter Sunday, ascension = Ascension Day, whitsun = Whitsunday, offset with :+/-n e.g.: easter:+1 = Easter Monday
de: Semikolon getrennte Liste von Datumswerten: yyyy-mm-dd = Einzeldatum, mm-dd = jährliche Wiederholung, easter[greg|jul|orth] = Ostersonntag, ascension = Christi Himmelfahrt, whitsun = Pfingstsonntag, Offset mit :+/-n z.B: easter:+1 = Ostermontag

# field:cashbook.configuration,holidays_info:
source: Holidays
de: Feiertage

# help:cashbook.configuration,holidays_info:
source: Holidays in the current year.
de: Feiertage im aktuellen Jahr.

# model:cashbook.planner,name:
source: Scheduled Booking
de: geplante Buchung

# view:cashbook.planner:
source: Recurrence Rule
de: Wiederholregel

# view:cashbook.planner:
source: Result of the recurrence rule
de: Ergebnis der Wiederholregel

# view:cashbook.planner:
source: Description
de: Beschreibung

# view:cashbook.planner:
source: Booking
de: Buchung

# view:cashbook.planner:
source: Booking text
de: Buchungstext

# view:cashbook.planner:
source: Available placeholders: ${date} ${month} ${year} ${amount} ${quantity} ${rate}
de: verfügbare Platzhalter: ${date} ${month} ${year} ${amount} ${quantity} ${rate}

# view:cashbook.planner:
source: Cashbook lines
de: Kassenbuchzeilen

# field:cashbook.planner,company:
source: Company
de: Unternehmen

# field:cashbook.planner,cashbook:
source: Cashbook
de: Kassenbuch

# help:cashbook.planner,cashbook:
source: Cash book for which the planned posting is to be executed.
de: Kassenbuch für welches die geplante Buchung ausgeführt werden soll.

# field:cashbook.planner,description:
source: Description
de: Beschreibung

# field:cashbook.planner,start_date:
source: Start Date
de: Startdatum

# field:cashbook.planner,end_date:
source: End Date
de: Endedatum

# field:cashbook.planner,frequ:
source: Frequency
de: Frequenz

# selection:cashbook.planner,frequ:
source: Yearly
de: Jährlich

# selection:cashbook.planner,frequ:
source: Monthly
de: Monatlich

# selection:cashbook.planner,frequ:
source: Weekly
de: Wöchentlich

# selection:cashbook.planner,frequ:
source: Daily
de: Täglich

# field:cashbook.planner,weekday:
source: Weekday
de: Wochentag

# help:cashbook.planner,weekday:
source: Select a day of the week if you want the rule to run on that day.
de: Wählen Sie einen Wochentag aus, wenn die Regel an diesem Tag ausgeführt werden soll.

# selection:cashbook.planner,weekday:
source: Monday
de: Montag

# selection:cashbook.planner,weekday:
source: Tuesday
de: Dienstag

# selection:cashbook.planner,weekday:
source: Wednesday
de: Mittwoch

# selection:cashbook.planner,weekday:
source: Thursday
de: Donnerstag

# selection:cashbook.planner,weekday:
source: Friday
de: Freitag

# selection:cashbook.planner,weekday:
source: Saturday
de: Samstag

# selection:cashbook.planner,weekday:
source: Sunday
de: Sonntag

# field:cashbook.planner,monthday:
source: Day of month
de: Tag des Monats

# help:cashbook.planner,monthday:
source: If you want the rule to run on a specific day of the month, select the day here.
de: Wenn die Regel an einem bestimmten Tag im Monat ausgeführt soll, wählen Sie hier den Tag.

# field:cashbook.planner,interval:
source: Interval
de: Intervall

# help:cashbook.planner,interval:
source: Select an interval to run the rule on every n-th date.
de: Wählen Sie einen Intervall um die Regel an jedem n-ten Datum auszuführen.

# field:cashbook.planner,nextdates:
source: Next Dates
de: nächste Termine

# help:cashbook.planner,nextdates:
source: the next 5 appointments based on the configured rule
de: die nächsten 5 Termine anhand der konfigurierten Regel

# field:cashbook.planner,setpos:
source: Occurrence
de: Ereignis

# help:cashbook.planner,setpos:
source: For example, if you want to run the rule on the second Wednesday of the month, enter 2 here.
de: Wenn Sie die Regel z.B. am zweiten Mittwoch im Monat ausführen möchten, tragen Sie hier 2 ein.

# field:cashbook.planner,nextrun:
source: Next Execution Date
de: Nächster Ausführungstermin

# field:cashbook.planner,nextrun_date:
source: Next Execution Date
de: Nächster Ausführungstermin

# field:cashbook.planner,bookingtype:
source: Type
de: Typ

# help:cashbook.planner,bookingtype:
source: Type of Booking
de: Buchungstyp

# selection:cashbook.planner,bookingtype:
source: Revenue
de: Einnahme

# selection:cashbook.planner,bookingtype:
source: Expense
de: Ausgabe

# selection:cashbook.planner,bookingtype:
source: Transfer from
de: Umbuchung von

# selection:cashbook.planner,bookingtype:
source: Transfer to
de: Umbuchung nach

# field:cashbook.planner,currency_cashbook:
source: Currency
de: Währung

# help:cashbook.planner,currency_cashbook:
source: Currency of Cashbook
de: Währung des Kassenbuchs

# field:cashbook.planner,amount:
source: Amount
de: Betrag

# field:cashbook.planner,category:
source: Category
de: Kategorie

# help:cashbook.planner,category:
source: Category for the planned booking
de: Kategorie für die geplante Buchung

# field:cashbook.planner,booktransf:
source: Source/Dest
de: Quelle/Ziel

# field:cashbook.planner,owner_cashbook:
source: Owner
de: Eigentümer

# field:cashbook.planner,state_cashbook:
source: State of Cashbook
de: Status des Kassenbuchs

# field:cashbook.planner,subject:
source: Booking text
de: Buchungstext

# field:cashbook.planner,wfcheck:
source: Set to 'Checked'
de: auf 'Geprüft' setzen

# help:cashbook.planner,wfcheck:
source: Switches the booking to the 'Verified' state.
de: Schaltet die Buchung in den Zustand 'Geprüft'

# field:cashbook.planner,booking_target:
source: Target
de: Ziel

# field:cashbook.planner,cashbook_lines:
source: Cashbook lines
de: Kassenbuchzeilen

# help:cashbook.planner,cashbook_lines:
source: This cash book lines was generated by the current scheduled booking.
de: Diese Kassenbuchzeilen wurden durch die aktuelle geplante Buchung generiert.

# field:cashbook.planner,party:
source: Party
de: Partei

# field:cashbook.planner,move_event:
source: If no business day
de: Wenn kein Werktag

# selection:cashbook.planner,move_event:
source: unchanged
de: unverändert

# selection:cashbook.planner,move_event:
source: Business day before original date
de: Geschäftstag vor ursprünglichem Datum

# selection:cashbook.planner,move_event:
source: Business day after original date
de: Geschäftstag nach ursprünglichem Datum

# help:cashbook.planner,move_event:
source: If the date of execution falls on a weekend or holiday, it can be moved to a business day.
de: Wenn das Datum der Ausführung auf ein Wochenende oder Feiertag fällt, kann es auf einen Geschäftstag verschoben werden.

# field:cashbook.planner,last_day_of_month:
source: Last day of the month
de: letzer Tag des Monats

# help:cashbook.planner,last_day_of_month:
source: The booking is made on the last day of the month.
de: Die Buchung wird am letzten Tag des Monats ausgeführt.

# field:cashbook.planner,notify_bycron:
source: Notify
de: Benachrichtigen

# help:cashbook.planner,notify_bycron:
source: A notification will appear in the web browser when the booking has been created.
de: Es wird eine Benachrichtigung im Webbrowser angezeigt wenn die Buchung erstellt wurde.

# model:cashbook.planner.nextrun,name:
source: Next Execution Date
de: Nächster Ausführungstermin

# field:cashbook.planner.nextrun,planner:
source: Planner
de: geplante Buchung

# field:cashbook.planner.nextrun,date:
source: Date
de: Datum

# model:cashbook.planner_rel,name:
source: Scheduled Booking - Cashbook - Relation
de: geplante Buchung - Kassenbuch - Verknüpfung

# field:cashbook.planner_rel,planner:
source: Planner
de: geplante Buchung

# field:cashbook.planner_rel,line:
source: Cashbook Line
de: Kassenbuchzeile

# view:cashbook.book:
source: Scheduled Bookings
de: geplante Buchungen

# field:cashbook.book,planner:
source: Scheduled Bookings
de: geplante Buchungen

# view:cashbook.line:
source: Scheduled Bookings
de: geplante Buchungen

# field:cashbook.line,planners:
source: Scheduled Bookings
de: geplante Buchungen
